{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/the-midnight",
  "promos": {
    "1.15.2-recommended": "0.5.10",
    "1.15.2-latest": "0.5.10",
    "1.14.4-recommended": "0.4.7",
    "1.14.4-latest": "0.4.7",
    "1.12.2-recommended": "0.3.5",
    "1.12.2-latest": "0.3.5"
  },
  "1.15.2": {
    "0.5.8": "- Updated Forge to 31.2.0. This apparently also fixed a few other issues we were aware of such as Nightstone Furnaces not losing fuel when an invalid item is on top.\n- Fixed stinger eggs spawning on top of miasma (for real this time).\n- Disabled the ability to locate well and shadowroot guardtowers since they lock up the game for unknown reasons.",
    "0.5.9": "- Removed unnecessary debug code that would spam the server console.\n- Updated mods.toml with a larger description and proper credits to all current and past developers of The Midnight.\n- Added support for Forge's mod update checker.\n- Fixed TerraForged support.",
    "0.5.10": "Additions:\n- Brought back an ancient coremodding hack that renders entities as if they're being dragged on the ground when a rifter captures them. This rendering is experimental and should be disabled in the configuration settings if it causes issues.\n- Nightstone Furnace recipes now show in JEI.\n\nBug Fixes:\n- Grass should spawn on top of nightstone much less.\n- Fixed tall grass not being replaceable.\n- Fixed rifters teleporting into the Midnight without their victim.\n- Rifters not spawned through rifts will no longer capture mobs.\n- Fixed chest textures not being rendered correctly.\n- Fixed dead wood fences not connecting to each other or to walls.\n- Fixed the configuration option to have the rifts open in the daytime. It had the opposite effect before.\n- Fixed suavis placement bugs.\n- Addressed some language inconsistencies in the configuration screen.\n\nImprovements:\n- Thanks to the help of Bailey (@KingPhygieBoo) the sky gradient has returned! It looks just like it did in prior versions.\n- Rifters play idle sounds less and are quieter.\n- Added a configuration option to set the percent chance for rifters to spawn naturally (defaults to 50%).\n- Added a configuration option to set the percent chance for rifters to play idle sounds when they try to do so (defaults to 75%).\n- Entrance rift structures are now filled in the inside with air. No more random patches of grass, stone, etc. blocking your path to your own personal nightmare.\n\nChanges:\n- The new required minimum version of Minecraft Forge is 31.2.45.\n- You will be sent an in-game notification when the next release of The Midnight is available. It's gonna be a big one, so it's justified. If you don't want it, feel free to disable it in the client configuration settings! (Reminder that CTRL + \\ is the default keybind to open the config menu in the pause screen).\n- Decreased the rifter's natural armor.\n- Mobs (i.e. zombies) will no longer pick up spore bombs.\n- All coremodding hacks now use Spongepowered's Mixin instead of Forge's JS ASM API.\n- The Midnight will now always use moody brightness by default. This can be disabled in the client configuration settings, but even then your brightness setting will be halved in the dimension.\n- Nerfed the archaic glass recipe.\n- The glob fungus hat now glows like its little plant variant.\n- Crystalotus now glows."
  },
  "1.14.4": {
    "0.4.7": "- Updated Forge to 28.2.0.\n- Updated translations from the 1.15.2 version.\n- Fixed hunter movement.\n- Fixed stinger eggs spawning in at y=0.\n- Fixed bedrock not generating.\n- Rift entity no longer spawns on mushroom island.\n- Fixed small issue with the hunter.\n- Fixed crash where the game would try to find a stinger egg nest when there wasn't one.\n- When hunter attacks or is damaged, it wil fly back up to the sky (like the phantom).\n- Fixed hunter attack mechanic so you can guard from it.\n- Nerfed rifters.\n- Fixed not being able to swim in miasma.\n- Fixed SuavisBlock crash.\n- Fixed tall mistshrooms consuming bonemeal without growing anything.\n- Fixed shears being unusable on already carved sides of fungi hats.\n- Fixed inconsistent tendrilweed growing logic.\n- Fixed naming mistake with the deceitful snapper.\n- Fixed bedrock not generating properly.\n- Fixed molten craters replacing trees and large fungi with trenchstone.\n- Fixed origin of small bogshroom structure not existing.\n- Fixed wells not locatable by command.\n- Fixed miasma having orange fog color.\n- Fixed rouxe, bloomcrystal, and crystallotus having a (large) collision box.\n- Fixed rifter being the incorrect size.\n- Fixed glitchy night stag eating animation.\n- Fixed Midnight ambience not looping properly.\n- Fixed the chests' textures\n- Fixed flying and swimming entities having mud delay.\n- Fixed hunters not dropping cooked wings when killed by fire.\n- Fixed midnight ladders not making climbing noises.\n- Fixed display URL in the mod info page (mods.toml)."
  },
  "1.12.2": {
    "0.3.5": "- Spore bombs don't crash servers anymore\n- Patch with Better with Mods that now applies a loot condition to all main fishing pools in the loot table\n- Dry bog bug is fixed\n- New effect: Pollinated\n- When you walk around tendrilweed, you will receive this effect for 5s, which will cause plants from any other biomes in the game (modded or vanilla) to appear around you\n- Shadowroot crafting table works with the recipe book\n- Dragon's nest only generates by molten craters now\n- Flowers from other mods can appear in Midnight through the use of bonemeal (disabled by default in config)"
  }
}
